Tekla Open API Reference for Tekla Structures 2025
ClashCheckHandler.GetIntersectionBoundingBoxes Method
 Get a list of bounding boxes (AABB) of the clashing volumes of two objects.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ArrayList GetIntersectionBoundingBoxes(
	Identifier ID1,
	Identifier ID2
)
Public Function GetIntersectionBoundingBoxes (
	ID1 As Identifier,
	ID2 As Identifier
) As ArrayList
Parameters
ID1
Type: Tekla.Structures.Identifier
The identifier of the first object.
ID2
Type: Tekla.Structures.Identifier
The identifier of the second object.
Return Value
Type: ArrayList
A list of bounding boxes of the clashing volumes.
See Also
Reference
ClashCheckHandler Class
Tekla.Structures.Model Namespace